OpenFOAM-v1812/tutorials/incompressible/pimpleFoam/RAS/propeller/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

# copy propeller surface from resources directory
cp -rf \
    "$FOAM_TUTORIALS"/resources/geometry/propeller \
    constant/triSurface

runApplication blockMesh

runApplication surfaceFeatureExtract

runApplication snappyHexMesh -overwrite

runApplication renumberMesh -overwrite

# force removal of fields generated by snappy
rm -rf 0

# generate face/cell sets and zones
runApplication topoSet -dict system/createInletOutletSets.topoSetDict

# create the inlet/outlet and AMI patches
runApplication createPatch -overwrite

#------------------------------------------------------------------------------
